app/BundleCourse.php

    public function getCourses()
    {
        return Cache::remember('courses_get_classes_'.  $this->id, config('cache.time'), function () {
            return Course::whereIn('id', $this->course_id)->get();
        });
---
select * from `courses` where `id` in ('4')

    public function users(){

        return Cache::remember('courses_users_'.  $this->id, config('cache.time'), function () {
            $user_id = $this->getCourses()->pluck('user_id')->toArray();
            $users = User::whereIn('id', $user_id)->get();
---
select * from `users` where `id` in ('2')

    public function videoCount(){
        // $videos = CourseClass::whereIn('course_id', $this->course_id)->count();

        return Cache::remember('courses_video_count_'.  $this->id, config('cache.time'), function () {
            return CourseClass::whereIn('course_id', $this->course_id)->count();;
        });
---
select count(*) as aggregate from `course_classes` where `course_id` in ('4')