app/Course.php

select `user_id` from `user_purchased_courses` where (`course_id` = 4) group by `user_id`
select count(*) as aggregate from `user_watch_timelogs` where (`course_id` = 4) group by `course_id`
---
    public function getLearnerCountAttribute()
    {
        // $count = (100 + $this->id + strlen($this->title) + $this->courseclass->count());
        // $purchased_courses = UserPurchasedCourse::where(['course_id' => $this->id])->groupBy('user_id')->pluck('user_id')->toArray();

        // if($purchased_courses !=null){
        //     $subscribers = UserWatchTimelog::where(['course_id'=>$this->id])->whereNotIn('user_id', $purchased_courses)->groupBy('course_id')->count();
        //     // $count = $count + $subscribers;
        //     $count = $subscribers + count($purchased_courses);
        // }else{
        //     $subscribers = UserWatchTimelog::where(['course_id'=>$this->id])->groupBy('course_id')->count();
        //     // $count = $count + $subscribers;
        //     $count = $subscribers;
        // }

        return Cache::remember('class_learners_count_'.$this->id, config('cache.time'), function () {
            $purchased_courses = UserPurchasedCourse::where(['course_id' => $this->id])->groupBy('user_id')->pluck('user_id')->toArray();
            if($purchased_courses !=null){
                $subscribers = UserWatchTimelog::where(['course_id'=>$this->id])->whereNotIn('user_id', $purchased_courses)->groupBy('course_id')->count();
                $count = $subscribers + count($purchased_courses);
            }else{
                $subscribers = UserWatchTimelog::where(['course_id'=>$this->id])->groupBy('course_id')->count();
                $count = $subscribers;
            }
            return $count;
        });

select * from `master_classes` where `master_classes`.`course_id` = 4 and `master_classes`.`course_id` is not null limit 1
---
    public function getAverageRatingAttribute()
    {
        $avgRating = Cache::remember('class_avg_rating_'.$this->id, config('cache.time'), function () {
            $avgRating = $this->review->avg('rating');

            if($avgRating == 0 || empty($avgRating))
                $avgRating = $this->masterclass ? 5 : 4;

            return $avgRating;
        });