app/Http/Controllers/HomeController.php

        if(Auth::check()){
            $playlists = Playlist::where('user_id', Auth::user()->id)->get();
        }
        $master_classes = MasterClass::with('courses','courses.user')->get();
---
select * from `master_classes`