app/Http/Controllers/HomeController.php

    public function index(Request $request)
    {
        $categories = [];
        $sliders = Slider::orderBy('position', 'ASC')->get();
        $facts = SliderFacts::limit(3)->get();
        // $categories = CategorySlider::first();
        $cor = Course::all();
        $bundles = BundleCourse::get();
        $playlists = [];
        $firstSection = FirstSection::first();
        $langauges = CourseLanguage::where(['status'=>1])->get();
		$filter_categories = Categories::with('subcategory')->where(['status'=>1])->get();
---
select * from `courses`
select * from `sub_categories` where `sub_categories`.`category_id` in (2)

        }
        $master_classes = MasterClass::with(array('courses' => function($query) {$query->where('status', 1)->orderBy('order');}),'courses.user')->get();

        $featuredMentor = FeaturedMentor::with('user','courses','courses.category')->where(['status'=>'1'])->get();

		$bundleCoures = BundleCourse::where(['status'=>1])->get();

        $categories = Categories::with(array('courses' => function($query) {$query->orderBy('order')->where('status', 1);}),'subcategory')->where('featured','1')->orderBy('position','ASC')->get();
---
select * from `users` where `users`.`id` in (2)
select * from `featured_mentors` where (`status` = '1')
select * from `bundle_courses` where (`status` = 1)
select * from `categories` where `featured` = '1' order by `position` asc
select * from `courses` where `status` = 1 and `courses`.`category_id` in (2) and `status` = 1 order by `order` asc