app/Http/Controllers/SearchController.php

select * from `course_languages` where (`status` = 1)
select * from `sub_categories` where `sub_categories`.`category_id` in (2)
---
	public function courses(Request $request)
    {

		$langauges = CourseLanguage::where(['status'=>1])->get();
		$filter_categories = Categories::with('subcategory')->where(['status'=>1])->get();

select * from `bundle_courses` where (`status` = 1)
---

		}
		else{
			$bundleCoures = BundleCourse::where(['status'=>1])->get();